In [53]:
import pandas as pd

In [54]:
data = 'https://www.gairuo.com/file/data/dataset/team.xlsx'
df = pd.read_excel(data, index_col='name') # 将索引设置为name
df

         team  Q1  Q2  Q3  Q4
name
Liver       E  89  21  24  64
Arry        C  36  37  37  57
Ack         A  57  60  18  84
Eorge       C  93  96  71  78
Oah         D  65  49  61  86
...       ...  ..  ..  ..  ..
Gabriel     C  48  59  87  74
Austin7     C  21  31  30  43
Lincoln4    C  98  93   1  20
Eli         E  11  74  58  91
Ben         E  21  43  41  74

[100 rows x 5 columns]

In [55]:
df = pd.read_excel(data) # 读取数据不设索引
df.set_index('name') # 设置索引

         team  Q1  Q2  Q3  Q4
name
Liver       E  89  21  24  64
Arry        C  36  37  37  57
Ack         A  57  60  18  84
Eorge       C  93  96  71  78
Oah         D  65  49  61  86
...       ...  ..  ..  ..  ..
Gabriel     C  48  59  87  74
Austin7     C  21  31  30  43
Lincoln4    C  98  93   1  20
Eli         E  11  74  58  91
Ben         E  21  43  41  74

[100 rows x 5 columns]

In [56]:
df.set_index(['name', 'team']) # 设置两层索引

               Q1  Q2  Q3  Q4
name     team
Liver    E     89  21  24  64
Arry     C     36  37  37  57
Ack      A     57  60  18  84
Eorge    C     93  96  71  78
Oah      D     65  49  61  86
...            ..  ..  ..  ..
Gabriel  C     48  59  87  74
Austin7  C     21  31  30  43
Lincoln4 C     98  93   1  20
Eli      E     11  74  58  91
Ben      E     21  43  41  74

[100 rows x 4 columns]

In [57]:
df.set_index([df.name.str[0],'name']) # 将姓名的第一个字母和姓名设置为索引

              team  Q1  Q2  Q3  Q4
name name
L    Liver       E  89  21  24  64
A    Arry        C  36  37  37  57
     Ack         A  57  60  18  84
E    Eorge       C  93  96  71  78
O    Oah         D  65  49  61  86
...            ...  ..  ..  ..  ..
G    Gabriel     C  48  59  87  74
A    Austin7     C  21  31  30  43
L    Lincoln4    C  98  93   1  20
E    Eli         E  11  74  58  91
B    Ben         E  21  43  41  74

[100 rows x 5 columns]

In [58]:
df = df.set_index('name') # 建立索引并重写覆盖df
df

         team  Q1  Q2  Q3  Q4
name
Liver       E  89  21  24  64
Arry        C  36  37  37  57
Ack         A  57  60  18  84
Eorge       C  93  96  71  78
Oah         D  65  49  61  86
...       ...  ..  ..  ..  ..
Gabriel     C  48  59  87  74
Austin7     C  21  31  30  43
Lincoln4    C  98  93   1  20
Eli         E  11  74  58  91
Ben         E  21  43  41  74

[100 rows x 5 columns]

In [59]:
pd.RangeIndex(1,100,2)
# RangeIndex(start=1, stop=100, step=2)

RangeIndex(start=1, stop=100, step=2)

In [60]:
pd.Index([1, 2, 3])
# Int64Index([1, 2, 3], dtype='int64')

Index([1, 2, 3], dtype='int64')

In [61]:
pd.Index(list('abc'))
# Index(['a', 'b', 'c'], dtype='object')

Index(['a', 'b', 'c'], dtype='object')

In [62]:
# 可以用name指定一个索引名称
pd.Index(['e', 'd', 'a', 'b'], name='something')

Index(['e', 'd', 'a', 'b'], dtype='object', name='something')

In [63]:
# 常用属性
df.index.name # 名称

'name'

In [64]:
df.index.array # array数组

<PandasArray>
[    'Liver',      'Arry',       'Ack',     'Eorge',       'Oah',    'Harlie',
      'Acob',      'Lfie',    'Reddie',     'Oscar',       'Leo',     'Logan',
    'Archie',      'Theo',    'Thomas',     'James',    'Joshua',     'Henry',
   'William',       'Max',     'Lucas',     'Ethan',    'Arthur',     'Mason',
     'Isaac',  'Harrison',     'Teddy',    'Finley',    'Daniel',     'Riley',
    'Edward',    'Joseph', 'Alexander',      'Adam',   'Reggie1',    'Samuel',
     'Jaxon', 'Sebastian',    'Elijah',    'Harley',      'Toby',     'Arlo8',
     'Dylan',      'Jude',  'Benjamin',     'Rory9',     'Tommy',     'Jake3',
     'Louie',   'Carter7',    'Jenson',     'Hugo0',    'Bobby1',   'Frankie',
    'Ollie3',   'Zachary',     'David',    'Albie1',     'Lewis',      'Luca',
    'Ronnie',  'Jackson5',   'Matthew',      'Alex',   'Harvey2',    'Reuben',
   'Jayden6',     'Caleb',   'Hunter3', 'Theodore3',    'Nathan',     'Blake',
     'Luke6',    'Elliot',     'Roman',   'Stanley',    'Dexter',   'Michael',
   'Elliott',     'Tyler',      'Ryan',     'Ellis',      'Finn',   'Albert0',
       'Kai',      'Liam',     'Calum',    'Louis2',     'Aaron',      'Ezra',
      'Leon',    'Connor',  'Grayson7',    'Jamie0',     'Aiden',   'Gabriel',
   'Austin7',  'Lincoln4',       'Eli',       'Ben']
Length: 100, dtype: object

In [65]:
df.index.dtype # 数据类型

dtype('O')

In [66]:
df.index.shape # 形状

(100,)

In [67]:
df.index.size # 元素数量

100

In [68]:
df.index.values # array数组

array(['Liver', 'Arry', 'Ack', 'Eorge', 'Oah', 'Harlie', 'Acob', 'Lfie',
       'Reddie', 'Oscar', 'Leo', 'Logan', 'Archie', 'Theo', 'Thomas',
       'James', 'Joshua', 'Henry', 'William', 'Max', 'Lucas', 'Ethan',
       'Arthur', 'Mason', 'Isaac', 'Harrison', 'Teddy', 'Finley',
       'Daniel', 'Riley', 'Edward', 'Joseph', 'Alexander', 'Adam',
       'Reggie1', 'Samuel', 'Jaxon', 'Sebastian', 'Elijah', 'Harley',
       'Toby', 'Arlo8', 'Dylan', 'Jude', 'Benjamin', 'Rory9', 'Tommy',
       'Jake3', 'Louie', 'Carter7', 'Jenson', 'Hugo0', 'Bobby1',
       'Frankie', 'Ollie3', 'Zachary', 'David', 'Albie1', 'Lewis', 'Luca',
       'Ronnie', 'Jackson5', 'Matthew', 'Alex', 'Harvey2', 'Reuben',
       'Jayden6', 'Caleb', 'Hunter3', 'Theodore3', 'Nathan', 'Blake',
       'Luke6', 'Elliot', 'Roman', 'Stanley', 'Dexter', 'Michael',
       'Elliott', 'Tyler', 'Ryan', 'Ellis', 'Finn', 'Albert0', 'Kai',
       'Liam', 'Calum', 'Louis2', 'Aaron', 'Ezra', 'Leon', 'Connor',
       'Grayson7', 'Jamie0', 'Aiden', 'Gabriel', 'Austin7', 'Lincoln4',
       'Eli', 'Ben'], dtype=object)

In [69]:
# 其他，不常用
df.index.empty # 是否为空

False

In [70]:
df.index.is_unique # 是否不重复

True

In [71]:
df.index.names # 名称列表

FrozenList(['name'])

In [72]:
df.index.has_duplicates # 是否有重复值

False

In [73]:
df.index.values # 索引的值array

array(['Liver', 'Arry', 'Ack', 'Eorge', 'Oah', 'Harlie', 'Acob', 'Lfie',
       'Reddie', 'Oscar', 'Leo', 'Logan', 'Archie', 'Theo', 'Thomas',
       'James', 'Joshua', 'Henry', 'William', 'Max', 'Lucas', 'Ethan',
       'Arthur', 'Mason', 'Isaac', 'Harrison', 'Teddy', 'Finley',
       'Daniel', 'Riley', 'Edward', 'Joseph', 'Alexander', 'Adam',
       'Reggie1', 'Samuel', 'Jaxon', 'Sebastian', 'Elijah', 'Harley',
       'Toby', 'Arlo8', 'Dylan', 'Jude', 'Benjamin', 'Rory9', 'Tommy',
       'Jake3', 'Louie', 'Carter7', 'Jenson', 'Hugo0', 'Bobby1',
       'Frankie', 'Ollie3', 'Zachary', 'David', 'Albie1', 'Lewis', 'Luca',
       'Ronnie', 'Jackson5', 'Matthew', 'Alex', 'Harvey2', 'Reuben',
       'Jayden6', 'Caleb', 'Hunter3', 'Theodore3', 'Nathan', 'Blake',
       'Luke6', 'Elliot', 'Roman', 'Stanley', 'Dexter', 'Michael',
       'Elliott', 'Tyler', 'Ryan', 'Ellis', 'Finn', 'Albert0', 'Kai',
       'Liam', 'Calum', 'Louis2', 'Aaron', 'Ezra', 'Leon', 'Connor',
       'Grayson7', 'Jamie0', 'Aiden', 'Gabriel', 'Austin7', 'Lincoln4',
       'Eli', 'Ben'], dtype=object)